# -*- coding: utf-8 -*-
"""-0-3-0-ipynb.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/gist/Maria-lilith/6311e70149936bf71d76217bfa950af3/-0-3-0-ipynb.ipynb

ФИО
"""

Новоселова Мария Антоновна и Ягловская Елизавета Михайловна

"""**Во всей практике нельзя применять библиотеки предоставляющие готовые решения!**

# **Задача 1.**

Типы данных Напишите программу на Python, которая принимает список чисел в качестве входных данных от пользователя, а затем выводит сумму, среднее значение и максимальное значение из списка.

***Нельзя использовать: len(), min(), max(), average(), sum()***

Дано:
```
1 2 3 4 5 6 7
```
Вывод:

```
Сумма чисел: 28
Среднее арифм.: 4.0
Максимальное значение: 7
```
"""

list_data = [int(value) for value in input().split()]
summ=0
k=0
m=0
for i in list_data:
  summ+=i
  k+=1
  if i>m:
    m=i
sr=summ/k
print('Сумма чисел:',summ)
print('Среднее арифм.:',sr)
print('Максимальное значение:',m)

"""# **Задача 2.**

Напишите программу на Python, которая принимает список слов в качестве входных данных от пользователя, а затем распечатывает список в обратном порядке.

Ввод:

```
апельсин мандарин яблоко
```

Вывод:

```
яблоко мандарин апельсин
```
"""

s=input().split()
print(s[::-1])

"""# **Задача 3**

Простой чат-бот
Создайте простого чат-бота, который отвечает на основные запросы пользователей. Программа должна использовать условные выражения для определения намерений пользователя и последующего соответствующего ответа.

Чат бот может:

- помогать складывать числа
- подсказывать фильм, музыку и тд (из заранее созданного списка)
- создавать список дел (а также выводить его, обновлять, очищать)

Интерфейс чат-бота на ваше усмотрение, это могут быть как заранее определенные команды, так и к примеру вызов команды по номеру

*Реализовать без использования функций*

Пример:

Ввод:

```
Олег, какую мызыку посоветуешь?
```

Вывод:

```
Я бы посоветовал вам: Led Zeppelin Stairway to Heaven
```
"""

import random
list1=[]
open=''
while open!='выйти':
  c=input('Выберите команду: музыка, фильмы, сложить числа, список дел')
  music=[ 'Майя Кристалинская НЕЖНОСТЬ','Кино КУКУШКА','Михаил Глинка СЛАВЬСЯ','Егор и Опизденевшие ВЕЧНАЯ ВЕСНА','Александр Башлачев ВРЕМЯ КОЛОКОЛЬЧИКОВ',
        'Дельфин ВЕСНА','Егор Летов ВСЕ КАК У ЛЮДЕЙ','Владимир Высоцкий БАЛЛАДА ОБ УХОДЕ В РАЙ','Калинов Мост РОДНАЯ','Любэ КОНЬ','Телевизор КВАДРАТЫ','Григорий Лепс НАТАЛИ','Алиса ТЕАТР ТЕНЕЙ','Петр Мамонов СЕРЫЙ ГОЛУБЬ',
          'Кипелов КОСОВО ПОЛЕ','Nautilus Pompilius ШАР ЦВЕТА ХАКИ']
  films=['SuperАлиби','Я, Тоня / Тоня против всех','Лучшие враги','Пара на праздники','Во всё тяжкое / Ричард прощается','Никто','Любовь и монстры','Там, где раки поют']
  com=['музыка', 'фильмы', 'сложить числа', 'список дел']
  sp=['создать','добавить','очистить','вывести']
  if c in com:
    if c==com[0]:
      print('Послушайте этот шедевр:',random.choice(music))
    elif c==com[1]:
      print('Посмотрите этот шедевр:',random.choice(films))
    elif c==com[2]:
      list_data = [int(value) for value in input().split()]
      print(sum(list_data))
    else:
      s=input('Выберите команду:создать, добавить, очистить, вывести')
      if s in sp:
        if s==sp[0]:
          new=input('Введите список дел через запятую:').split(',')
          list1+=new
        elif s==sp[1]:
          new=input('Введите новые дела через запятую:').split(',')
          list1+=new
        elif s==sp[2]:
          list1=[]
        elif s==sp[3]:
          print(list1)
        else:
          print('Такой команды нет')
  else:
    print('Такой команды нет')
  open=input('Продолжить или выйти?')

"""# **Задача 4.**

Камень, ножницы, бумага

Создайте игру в Камень, ножницы, бумагу, в которой пользователь может играть против компьютера. Программа должна запросить выбор пользователя, а затем сгенерировать выбор компьютера. Затем программа должна определить победителя на основе правил игры.

**Этап 1:**

Определение победителя

**Этап 2:**
  
Игра до 3 побед


Ввод для "Этап 1":

```
Камень
```

Вывод:

```
Компьютер: Ножницы
Игрок: Камень
Победа: Игрок
```
"""

A=['камень','ножницы','бумага']
winp=0
winr=0
while winr!=3 and winp!=3:
  player=input()
  import random
  ran=random.choice(A)
  if (player=='камень' and ran=='бумага') or (player=='бумага' and ran=='ножницы') or (player=='ножницы' and ran=='камень'):
    print('Компьютер:',ran,  '\nИгрок:', player,  '\nПобеда: Компьютер')
    winr+=1
  elif (player=='камень' and ran=='ножницы') or (player=='бумага' and ran=='камень') or (player=='ножницы' and ran=='бумага'):
    print('Компьютер:',ran,'\nИгрок:', player, '\nПобеда: Игрок')
    winp+=1
  else:
    print('Компьютер:',ran,'\nИгрок:', player,'\nНичья')
if winr==3:
  print('Победил компьютер')
elif winp==3:
  print('Победил игрок')

"""# **Задача 6.**

Создайте игру "Палач" или "Виселица", в которой пользователь должен угадать слово, предлагая буквы. Программа должна выбрать случайное слово, а затем разрешить пользователю угадывать буквы. После каждого угадывания программа должна сообщать пользователю, есть ли в слове буква или нет.

**Этап 1**
Создать саму игру

**Этап 2:**
Ввести подсчет количества очков и ограничения на попытки

**Этап 3:** Добавить возможность сразу угадать слово
"""

words=['толерантность', 'эксгумация', 'либерализм', 'экспонат', 'пышность', 'скабрёзность', 'шаловливость', 'экспозиция', 'индульгенция', 'контрацептив', 'шкворень', 'эпиграф', 'эпитафия', 'барбекю', 'жульен', 'энцефалопатия', 'парашютист', 'импозантность', 'индифферент', 'демультипликатор', 'педикулёз', 'выхухоль', 'россомаха', 'сущность', 'поэтапность', 'напыщенность', 'возвышенность']
import random
w1=random.choice(words)
print('_'*len(w1))
att=0
s='_'*len(w1)
while att!=9:
  let=input()
  if len(let)==1:
    if let in w1:
      print('такая буква есть',)
      for i in range(len(w1)):
        if w1[i]==let:
          s=s[:i]+let+s[i+1:]
      print(s)
    else:
      print('такой буквы нет')
      att+=1
  else:
    if let==w1:
      print('Верно, слово:',w1)
      break
    else:
      print('неверно')
      att+=1
if att==9:
  print('Вы проиграли! Слово:',w1)

"""# **Дополнительно: Задача 7.**

**Цифра на определенном месте:**

Последовательно записан натуральный ряд чисел.

Какая цифра стоит в N позиции


Вввод:

```
Введите номер позиции: 1234567890
```

Вывод:

```
8
```
"""

N=int(input())
s=0
for i in range(1,N+1):
  s+=len(str(i))
  if s>=N:
    print(str(i)[N-s-1])
    break
#Про время работы кода ничего не говорилось, поэтому там +- 2 минутки подождать и всё будет